Revit 2026 API

# DirectContext3DHandleOverrides Methods

---

The DirectContext3DHandleOverrides type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source overrides to this object. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDirectContext3DHandleSettings | Gets override settings associated with a DirectContext3D handle instance or type. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents of two overrides are equal. |
|  | SetDirectContext3DHandleSettings | Assigns override settings associated with a DirectContext3D handle instance or type. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace